Revit 2027 API
FabricationPart.AddPartCustomData Method
 Add custom data type to the fabrication part. The new data gets the default value defined by the fabrication configuration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AddPartCustomData(
	int customId
)
Public Function AddPartCustomData (
	customId As Integer
) As Boolean
public:
bool AddPartCustomData(
	int customId
)
member AddPartCustomData :
        customId : int -> bool
Parameters
customId Int32
 The identifier of the custom data field to add.
Return Value
Boolean
 Returns true if the type was not already present.
Exceptions
Exception | Condition
ArgumentException |  The custom data identifier does not exist.
Remarks
 The custom id must be positive.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace